

/////////////////////////parameter////////////////////////////////////////////////////////////
{
    const rightgreen = "#7FFFAA", slivergray = "#C0C0C0", brown = "#F4A460", pink = "#FFC0CB";
    const orange = "#FFA500", skyblue = "#87CEEB", lightgray = "#DCDCDC";
    const purplegray = "#E6E6FA",	lightorange="#FFDEAD", Lime="#00FF00";//亮绿色
    const lightgreen = "#98FB98", azure = "#F0FFFF", Aqua = "#D4F2E7";//淡水绿色
    const lightcyan = "#E1FFFF", tomatored="#FF6347", Ivory="#FFFFD0";
    const GreenYellow="#ADFF2F", Khaki="#F0E68C";//卡其色
    const Lavender="#E6E6FA" , MistyRose="#FFE4E1";// 薰衣草淡紫 //薄雾玫瑰 MistyRose淡粉红



    var rules = [
         //      长词在前，否则短词span切割会导致长词检索不到



        { word: "不符合题意", level: 29 }, //lightorange
        { word: "不正确", level: 29 },
        { word: "进中国故事", level: 29 },
        { word: "战役情", level: 29 },//
        { word: "能动新", level: 29 },
        { word: "既使", level: 29 },
        { word: "认命", level: 29 },
        { word: "共商国事", level: 29 },



        { word: "完法", level: 57 }, //tomatored
        { word: "自已", level: 57 },
        { word: "己经", level: 57 },
        { word: "检查机关", level: 57 },
        { word: "检查院", level: 57 },

        { word: "领导入", level: 57 },// 绝对错误  雷
        { word: "矛厝", level: 57 },//
        { word: "蚂蚊", level: 57 },
        { word: "良妍", level: 57 },
        { word: "决第", level: 57 },
        { word: "轻犯", level: 57 },
        { word: "关部们", level: 57 },//   绝对错误
        { word: "开关之年", level: 57 },//tomatored
        // { word: "决第", level: 57 },
        // { word: "轻犯", level: 57 },
        // { word: "部们", level: 57 },//   绝对错误 雷
        // { word: "决第", level: 57 },
        // { word: "轻犯", level: 57 },
        // { word: "部们", level: 57 },
        // { word: "决第", level: 57 },
        // { word: "轻犯", level: 57 },
        // { word: "部们", level: 57 },



        { word: "给与", level: 48 },
        { word: "给于", level: 48 },
        { word: "是是", level: 48 },
        { word: "当家做主", level: 48 },
        { word: "属于属于", level: 48 }, //pink 相对错误
        { word: "概据", level: 48 },
        { word: "只是点", level: 48 },
        { word: "邓小乎", level: 48 },
        { word: "刑法处罚", level: 48 }, //pink 相对错误
        { word: "审关", level: 48 },
        { word: "依完", level: 48 },
        { word: "此次时间", level: 48 }, //pink 相对错误
        { word: "坚这", level: 48 },
        { word: "民族政治", level: 48 },
        { word: "没有得到犯罪程度", level: 48 },
        { word: "対", level: 48 },
        { word: "而案闻", level: 48 },
        { word: "音惠", level: 48 },   //普惠
        { word: "赋子", level: 48 },  //赋予
        { word: "作用作用", level: 48 },
        { word: "区城", level: 48 },
        { word: "杜会", level: 48 },//pink 相对错误
        { word: "抚乱", level: 48 },
        { word: "为人民为实事", level: 48 },
        { word: "静中游动", level: 48 },
        { word: "具体智慧的结晶", level: 48 },
        { word: "带口罩", level: 48 },
        // { word: "权力关", level: 48 },  // ?? 权力机关？    false 将权力关进制度的笼子里
        { word: "建没", level: 48 },
        { word: "我各民族", level: 48 },//pink 相对错误
        { word: "奥论", level: 48 },
        { word: "收人", level: 48 },
        { word: "产主了", level: 48 }, //产生  counter 共产主义
        { word: "能产主", level: 48 },
        { word: "会产主", level: 48 },
        { word: "进发出", level: 48 },
        // { word: "并发", level: 48 },
        { word: "写扬", level: 48 },
        { word: "需本", level: 48 },  //需要
        { word: "考直", level: 48 }, //考查
        { word: "了动权", level: 48 },//0.2 雷
        { word: "勒劳", level: 48 },   // 勤劳
        { word: "映像", level: 48 }, // 映像 改为 映象
        { word: "准人", level: 48 },//pink 相对错误
        { word: "竟争", level: 48 },
        { word: "材科", level: 48 },    //  材料
        { word: "住情深", level: 48 },     // 一往情深pink 粉红
        { word: "职贵", level: 48 },// 职责
        { word: "止有", level: 48 },   // “行止有耻”
        { word: "行已有耻", level: 48 }, //
        { word: "违反犯罪", level: 48 },     //违法
        { word: "依法法", level: 48 },//依法法治国
        { word: "贵任", level: 48 },   // 责任
        { word: "全年准确", level: 48 },     //全面
        { word: "的助人", level: 48 },// 情绪的 主人
        { word: "竟技", level: 48 },   //竞技
        { word: "人和方法", level: 48 },     //任何
        { word: "机关机关", level: 48 },//
        { word: "溢用", level: 48 },   //滥用
        { word: "美异", level: 48 },     //差异
        { word: "我国我国", level: 48 },//
        { word: "贏", level: 48 },   //赢
        { word: "冻内", level: 48 },//冻肉
        { word: "强调强调", level: 48 },   //
        { word: "|", level: 48 },     //
        { word: "有利与", level: 48 },//有利于
        { word: "专破", level: 48 },   //专政
        { word: "辨证", level: 48 },     //辩证    粉红
        { word: "一切从实际出、", level: 48 },// 从坚持一切从实际出发 雷
        { word: "形式严峻", level: 48 },   //形势严峻
        { word: "贫人口", level: 48 },     //贫困
        { word: "可能应做", level: 48 },//可能应做得不好而受到责备……应→因
        { word: "万种创新", level: 48 },   //
        { word: "署期", level: 48 },//《战狼Ⅱ》抓住署期档  雷
        { word: "习近乎", level: 48 },   //
        { word: "名营权", level: 48 },     // 名誉
        { word: "不和题意", level: 48 },// 不合题意
        { word: "扰乱了秩 ", level: 48 },   //，扰乱了秩 ；没有做到文明出行 雷
        { word: "骄做", level: 48 },     // 骄傲 雷
        { word: "抗议前线", level: 48 },  // 抗疫前线
        { word: "执政理念是以人为本", level: 48 },   //执政理念是立党为公，执政为民
        { word: "劳及劳动人民", level: 48 },     //pink 粉红 尊重和热爱劳动及劳动人民
        { word: "共字单车", level: 48 },//共享单车
        { word: "怡当", level: 48 },   // 恰当
        { word: "安情防控", level: 48 },     //疫情
        { word: "文化包新", level: 48 },// 创新
        { word: "安全行使", level: 48 },   // 为了孩子们安全行使， 雷 行驶
        { word: "一带路", level: 48 },     // 一带一路
        { word: "全勃以赴", level: 48 },   // 全力以赴
        { word: "在定条件", level: 48 },     // 在一定条件下  pink 粉红
        { word: "引领个", level: 48 }, //文化是引领一个民族前行的旗帜
        { word: "保人民知", level: 48 },   //切实保障人民知情权
        { word: "及映", level: 48 },//  反映
        { word: "拧虎", level: 48 },   //打虎拍蝇
        { word: "打黄扫非", level: 48 },     //中国扫黄打非网
        { word: "创新识", level: 48 },   //要求我们树立创新识 意识
        { word: "自身系质", level: 48 },     //  提升自身系质。    素质 雷           pink 粉红
        { word: "不代价", level: 48 },//是不代价与回报  不计代价
        { word: "堂不动摇", level: 48 },   //堂不动摇地以经济建设为中心 毫不
        { word: "战性", level: 48 },     //推动经济结构战性调整，
        { word: "发菜", level: 48 },//多种所有制经济共同发菜，
        { word: "清费", level: 48 },   //发挥清费对经济发展的基础性作用 消费
        { word: "故项正确", level: 48 },   // 不完整  改为 故②项正确
        { word: "故项错误", level: 48 },   // 
        { word: "李子染", level: 48 },   // 李子柒
        { word: "全民依法治国", level: 48 },   //全面
        { word: "數衍", level: 48 },   //數衍塞责
        { word: "遵法守法", level: 48 },   //
        { word: "习近平新时期", level: 48 },// 新时代
        { word: "始害无穷", level: 48 },   //123
        { word: "教育教育", level: 48 },     //
        { word: "多个和国家", level: 48 },//
        { word: "坚持切从实际出发", level: 48 },   //
        { word: "带案来", level: 48 },   //
        { word: "多种分配制并存", level: 48 },   //
        { word: "在定条件下", level: 48 },   //
        { word: "热爱劳及劳动", level: 48 },     //
        { word: "枪打出头乌", level: 48 },     //pink 粉红 “枪打出头鸟”
        { word: "社会实我", level: 48 },// 社会实我是不断发展的 社会实践
        { word: "医疗教治", level: 48 },//用于患者医疗教治费用的补助 医疗救治
        { word: "医疗数治", level: 48 },   //
        { word: "付相应责任", level: 48 },     //应付相应责任
        { word: "辦别", level: 48 },     // 辨别是非
        { word: "实现国家治理体现和治理能力现代化", level: 48 },     //雷
        // { word: "民主平等", level: 48 },     //
        { word: "读职", level: 48 },     // 渎职 对失职读职的进行依法惩处
        { word: "其抗疫情", level: 48 },//
        { word: "积极态度面", level: 48 },     //pink 粉红
        { word: "这并意味", level: 48 },//但这并意味着 雷
        { word: "壮族自治权", level: 48 },   //广西壮族自治权
        { word: "不负责任会付出代价”，故C", level: 48 },     //D. 对自己不负责任会付出代价”，故C项错误  雷
        { word: "将变成关好的", level: 48 },     //世界将变成关好的人间， 雷
        { word: "互签", level: 48 },     //
         { word: "事来", level: 48 },     //
        { word: "转为政府职能", level: 48 },     //
        { word: "是我们的生命变得更加饱满丰盈", level: 48 },// 是我们的生命变得更加饱满丰盈
        // { word: "达成彼此的理解和包容", level: 48 },//
        { word: "入民", level: 48 },// 我国各族入民 雷
        { word: "这是企业能力承担社会责任的体现", level: 48 },   //
        { word: "中国对促进世界共同发展为外交宗旨", level: 48 },     //
        { word: "中国负责人大国", level: 48 },     //
        { word: "公民的个人利于与国家利益", level: 48 },     //
        { word: "的基经济制度", level: 48 },     //
        { word: "以法治国", level: 48 },     //
        { word: "是主与客观", level: 48 },//是主与客观的具体的历史的统一
        { word: "依法行政是政府", level: 48 },     //pink 粉红
        { word: "信营", level: 48 },//
        { word: "像榜样学习", level: 48 },     //
        { word: "在使用法律", level: 48 },     //
        // { word: "是是", level: 48 },     //
        { word: "少数民主", level: 48 },     //
        // { word: "是是", level: 48 },     //
        { word: "才能得到们的尊重认可", level: 48 },//
        { word: "因地制宣", level: 48 },   //
        // { word: "是是", level: 48 },     //
        // { word: "是是", level: 48 },     //
        // { word: "是是", level: 48 },     //
        { word: "对中国优秀传统传统文化，", level: 48 },     //
        // { word: "是是", level: 48 },     //
        // { word: "当家做主", level: 48 },//
        // { word: "是是", level: 48 },     //pink 粉红
        // { word: "当家做主", level: 48 },//
        // { word: "是是", level: 48 },   //
        // { word: "是是", level: 48 },     //
        // { word: "是是", level: 48 },     //
        { word: "本题以 为素材", level: 48 },     //
        { word: "本题以为素材", level: 48 },     //
        { word: "闸述", level: 48 },     //
        { word: "內", level: 48 },//改善內部工作流程， 内部的内
        // { word: "当家做主", level: 48 },//

        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        // { word: "由", level: 18 },//
        { word: "主体使", level: 18 },//主体使执法部门
        { word: "享权利的", level: 18 },//我们每个人既是享权利的主体
        { word: "命运命运", level: 18 },//国家命运命运前途
        { word: "积极极", level: 18 },//积极极探索 改为 积极探索
        { word: "泄法调解的", level: 18 },//运用合理宣泄法调节的。
        { word: "速捕", level: 18 },//依法速捕
        { word: "的管体现", level: 18 },//的管理体现了
        { word: "著侈", level: 18 },//奢侈品
        { word: "权是人大的权", level: 18 },//立法权是人大是权利
        { word: "权是人大是权", level: 18 },//
        { word: "使用法律上一律平等", level: 18 },//在使用法律上一律平等
        { word: "京津翼", level: 18 },//实施京津翼一体化  雷
        { word: "行政政系统", level: 18 },//行政政系统
        { word: "目身", level: 18 },//联合国目身机构臃肿
        { word: "市人民幸福安康的前提", level: 18 },//市人民幸福安康的前提
        { word: "不干预父母倾诉", level: 18 },//不干预父母倾诉————干预→→敢与
        { word: "分离国家", level: 18 },//应当坚决反对分离国家的行为————分离→→分裂
        { word: "注意注意", level: 18 },//
        { word: "于父母倾诉", level: 18 },//不敢于父母倾诉
        { word: "力量使分散的", level: 18 },//个人的力量使分散的
        { word: "人义、", level: 18 },//人类命运共同体的人义、社会、民意基础，“人义”，改为：人文
        { word: "承担不用的", level: 18 },//不同角色要承担不用的责任
        { word: "个方敏", level: 18 },//两个方敏  方面
        { word: "工作人员的权利由", level: 18 },//政府及其工作人员的权力由法律授予
        { word: "法洽", level: 18 },//弘扬法洽精
        { word: "进行讨，", level: 18 },//
        { word: "召开会进", level: 18 },//召开会进行讨论，
        { word: "分析】", level: 18 },//【分析】
        { word: "和限，", level: 18 },//人的活动受自然规律制约和限，
        { word: "散步谣", level: 18 },//散步谣言
        { word: "议案设计的", level: 18 },//议案设计的 涉及
        { word: "学根据教材", level: 18 },//学根据教材知识
        { word: "影响响", level: 18 },//也会影响响粮食生产
        { word: "人民主专政", level: 18 },//我国坚持人民主专政
        { word: "的额", level: 18 },//
        { word: ")(", level: 18 },//
        { word: ")（", level: 18 },//
        { word: "）(", level: 18 },//
        { word: "）（", level: 18 },//
        { word: "专线债", level: 18 },//专线债，改为：专项债
        { word: "要求应选择不属于的选项", level: 18 },//题干要求应选择不属于的选项
        // { word: "p>主要考查了", level: 18 },// 改为本题主要考查了
        { word: "民存使", level: 18 },//
        { word: "大民行", level: 18 },//大民存使”改成“人民行使
        { word: "世园带来", level: 18 },//为世园带来数亿元的门票收入
        { word: "现了了", level: 18 },//体现了了协商民主的优
        { word: "人民代表来自人民", level: 18 },//人民代表来自人民 人民代表改为人大代表
        { word: "题未开放性", level: 18 },//本题未开放性试题
        { word: "可以看出开", level: 18 },//一句中可以看出开
        { word: "极端人主", level: 18 },//极端人主义。
        { word: "当前经济形势下和下", level: 18 },//就当前经济形势下和下半年经济工作
        { word: "国加人", level: 18 },//中国加人世界贸易组织
        { word: "注人", level: 18 },//健康发展注人新的活力
        { word: "；法办事", level: 18 },//依法办事
        { word: "这一王线", level: 18 },//始终围绕按劳分配这一王线
        { word: "米分析", level: 18 },//我们首先应从我国的国家性质米分析;
        { word: "因为宪法治国安邦", level: 18 },//是因为宪法治国安邦————“治国”前加：是
        { word: "进人新", level: 18 },//进人新时代
        { word: "再分析材料的基础", level: 18 },//再分析材料的基础上
        { word: "和被选择权", level: 18 },//有选举权和被选择权
        { word: "领导人领导人", level: 18 },//
        { word: "供大可能性", level: 18 },//提供大可能性，改为：提供了极大可能性，
        { word: "改革开方", level: 18 },//改革开方，“方”改为：放
        { word: "共克难过", level: 18 },//共克难过”，改为：共克难关
        { word: "社公劳动", level: 18 },//与社公劳动生产率成反比
        { word: "供欢影响", level: 18 },//供欢影响价格
        { word: "慢慢人生路", level: 18 },//在慢慢人生路上
        { word: "オ", level: 18 },//
        { word: "完备问", level: 18 },//
        { word: "机制灵活的", level: 18 },//机制灵活的方法
        { word: "宪法与其他法的关系", level: 18 },//宪法与其他法的关系 “法”改成“法律”。
        { word: "人大大代表", level: 18 },//人大大代表不都是
        { word: "依法执政的是党执政", level: 18 },//依法执政的是党执政基本方式
        { word: "位出发点", level: 18 },//以人民利益位出发点和落脚点
        { word: "也好保护好", level: 18 },//同时也好保护好个人的合法利益
        { word: "和及有", level: 18 },//各级党委和及有关政府部门
        { word: "灭提建", level: 18 },//灭提建设者  媒体
        { word: "这位现了", level: 18 },//这位现了文化的相对稳定性
        { word: "地级市与属于县级，杭州市西湖区人大代表实行直接选举", level: 18 },//
        { word: "国中国共产党", level: 18 },//C、国中国共产党是执政党
        { word: "事务故，", level: 18 },//管理国家各项事务故，
        { word: "执党执政", level: 18 },//依法执党执政的基本方式
        { word: "法制观念的好公民", level: 18 },//高度法制观念的好公民————法制→→法治
        { word: "園难", level: 18 },//  困难
        { word: "培券", level: 18 },//培券学生
        { word: "国际秩序的维护者，故B选项正确；", level: 18 },// 雷 选项  
        { word: "陷人", level: 18 },//
        { word: "从断提", level: 18 },//可从断提升自身综合素质，
        { word: "要过质变", level: 18 },//最终是要过质变实现的
        { word: "中国中国", level: 18 },//
        { word: "人民人民", level: 18 },//
        { word: "打并", level: 18 },//通过打并修塔
        { word: "人民民族", level: 18 },//是因为我国是人民民族的社会主义国家，
        { word: "厂泛", level: 18 },//厂泛性和真实性
        { word: "厂大", level: 18 },//进一步尊重和保障了厂大群众的人权。
        { word: "说明化制度意识", level: 18 },//这说明强化制度意识
        { word: "微信主义", level: 18 },//微信主义哲学阵营
        { word: "题干主要国企改革", level: 18 },// 雷
        { word: "某一方而", level: 18 },//某一方而，改为：某一方面
        { word: "荣厚", level: 18 },//知廉耻，懂荣厚
        { word: "平公平", level: 18 },//就业中的平公平现象
        { word: "水放光芒", level: 18 },//永
        { word: "基层众", level: 18 },//基层众自治制度
        { word: "是认识中不断前进", level: 18 },//应该是认识中不断前进
        { word: "有目的活动", level: 18 },//有目的的活动
        { word: "下降下降", level: 18 },//成本不断下降下降
        { word: "便捷流，", level: 18 },//有利于各类资源要素更加高效便捷流，
        { word: "卓理", level: 18 },//管理
        { word: "是指是", level: 18 },//自我解嘲是指是
        { word: "党的领导角度地位", level: 18 },//党的领导角度地位
        { word: "开开设", level: 18 },//开开设
        { word: "知识劳动报酬问题", level: 18 },//.知识劳动报酬问题  只是
        { word: "年龄、民主", level: 18 },//不分性别、年龄、民主、区域”————民主→民族
        { word: "多党和作", level: 18 },//中国共产党领导的多党和作和政治协商制度。
        { word: "的发思想", level: 18 },//以人民为中心的发思想
        { word: "政生活", level: 18 },//政治生活
        { word: "生活实际克重", level: 18 },//依据教材知识结合生活实际克重  可知
        { word: "权利制衡", level: 18 },//权力制衡
        { word: "违法了法", level: 18 },//违法了法律，
        { word: "懈息", level: 18 },//不得懈息、推诿
        { word: "指的是指的", level: 18 },//指的是指的是违反刑法以外的违法行为
        { word: "产阶领", level: 18 },//资本主义制度由资产阶领导
        { word: "单凭之力", level: 18 },//，我们得以完成许多单凭之力无法完成的事情。
        { word: "B.社会制度要适合本国国情，不是简单地说社会主义制度是世界是最先进的制度，故C", level: 18 },//雷
        { word: "是本质上是", level: 18 },//社会生活是本质上是实践的 改为 社会生活在本质上是实践的
        { word: "的之职", level: 18 },//发布命令的之职权
        { word: "机关工作人员应依法行使权利", level: 18 },//这说明国家机关工作人员应依法行使权利
        { word: "本题主要考查</p>", level: 18 },//本题主要考查 
        { word: "的是坚决不做", level: 18 },//触碰道德底线的是坚决不做
        { word: "考生基层", level: 18 },//考生基层民主管理
        { word: "生活跃起来", level: 18 },//当地经济生活跃起来改为当地经济生活也活跃起来
        { word: "全国人民代表大会制度", level: 18 },//
        { word: "学习他人的有点", level: 18 },//学习他人的有点
        { word: "给弱者给", level: 18 },//给弱者给予
        { word: "材料材料", level: 18 },//材料材料中
        { word: "体系人大", level: 18 },//体系人大常委会行使立法权
        { word: "基础和、", level: 18 },//立法基础和、
        { word: "基层民等", level: 18 },//社会基层民等角度入手作答即可。
        { word: "求合材料", level: 18 },//设问要求合材料一 改为（1）设问要求结合材料一
        { word: "公民，部分民族、", level: 18 },//我国年满十八周岁的公民，部分民族、种族
        { word: "代袭", level: 18 },//人大代表大会 人民代袭改为人民代表
        { word: "，查学生", level: 18 },//查学生对知识的识记和理解能力
        { word: "勇气和信息", level: 18 },//培养自己战胜困难的勇气和信息  信心
        { word: "的执动", level: 18 },//发挥消费对经济的执动作用 执动改为拉动
        { word: "公民的自由言论自由", level: 18 },//公民的自由言论自由是相对的 改为 公民的言论自由是相对的
        { word: "是社会主义经济的重要组成部分", level: 18 },//非公有制经济是社会主义经济的重要组成部分 改为 非公有制经济是社会主义市场经济的重要组成部分
        { word: "人民行使法范畴", level: 18 },//宪法职责不属于全体人民行使法范畴
        { word: "大大的地位", level: 18 },//大大的地位 人大 
        { word: "不简单地就是", level: 18 },//哲学不简单地就是
        { word: "赏彻", level: 18 },//赏彻  贯彻
        { word: "大大，", level: 18 },//
        { word: "、、", level: 18 },//
        { word: "义务的统一的", level: 18 },//权利和义务的统一的原则
        { word: "作崇", level: 18 },//作祟
        { word: "做合法好公民", level: 18 },//做合法好公民。改为：做守法好公民。
        { word: "蕴公", level: 18 },//  蕴含
        { word: "蔡质", level: 18 },//  素质 雷
        { word: "知识点为：</p>", level: 18 },//test 本题考查的主要知识点为：
        { word: "社会化主义", level: 18 },//中国特色社会化主义经济制度
        { word: "基础群众自治", level: 18 },//基础群众自治制度
        { word: "科技史第一生产力", level: 18 },//“科技史第一生产力”
        { word: "自觉维护这、", level: 18 },//自觉维护这、坚定捍卫者。
        { word: "既人民代表大会", level: 18 },//既人民代表大会制度 即”
        { word: "5GU", level: 18 },//5GU
        { word: "知识点为：5G", level: 18 },//知识点为：5G建设
        { word: "强强调", level: 18 },//与材料强强调的
        { word: "人民人民代表", level: 18 },//全国人民人民代表大会
        { word: "鉴定和平", level: 18 },//鉴定和平、发展、合作、共赢的信念
        { word: "我过实行", level: 18 },// 我过实行民族区域自治
        { word: "发决", level: 18 },//发决定展的决定性因素
        { word: "于我国国情相", level: 18 },//于我国国情相结合
        { word: "调解是有司法机关", level: 18 },//调解是有司法机关对当事人双方进行调
        { word: "各民主党都", level: 18 },//各民主党都得到宪法的承认和保护
        { word: "既人民代表大会", level: 18 },//既人民代表大会制度 “即”
        { word: "由党指定", level: 18 },//
        { word: "额能力", level: 18 },//力促自主研发创新额能力
        { word: "步人", level: 18 },//我国并没有步人世界科技强国之列
        { word: "反应决策问题", level: 18 },//漫画没有反应决策问题
        { word: "闭结", level: 18 },//是全国人民闭结奋斗的共同思想基础 闭结改为团结
        { word: "促，进", level: 18 },//中国成为全球最大5G市场有利于促，进生产发展 
        { word: "根具体", level: 18 },//根具体”改成“根据题干”。
        { word: "住意", level: 18 },//
        { word: "从民在法律", level: 18 },//考生可以从民在法律面前一律平等的原则 民改为公民
        { word: "】题考查", level: 18 },//【解析】题考查
        { word: "宪法是公民的基本活动准则", level: 18 },//宪法是公民的基本活动准则，————宪法是一切组织和个人的根本活动准则。
        { word: "写人宪法", level: 18 },//尊重和保障人权'写人宪法”
        { word: "勇于当担", level: 18 },//勇于当担
        { word: "介人", level: 18 },//借机介人南海问题，
        { word: "，求考生", level: 18 },//，求考生回答实行民族区域自治的必然性。
        { word: "法治观合", level: 18 },//增强他们的法治观合
        { word: "劳动是劳动者生产过程的主体", level: 18 },//劳动者是生产过程的主体 ，在生产力发展中起主导作用
        { word: "可以从一些精巧的活", level: 18 },//女生更加细心，可以从一些精巧的活。
        { word: "陶治", level: 18 },//
        { word: "直接人民群众的切身", level: 18 },//分配是否公平直接人民群众的切身利益和积极性影响 
        { word: "民意间", level: 18 },//重拳打击插手民意间纠纷、
        { word: "材料料", level: 18 },//材料料中，去掉一个料
        { word: "和宪性审查", level: 18 },//需要推进和宪性审查工作
        { word: "奉献人社会", level: 18 },//奉献人社会的人生价值，
        { word: "来纾解", level: 18 },//理智控制法来纾解
        { word: "于集体要求相一致", level: 18 },//于集体要求相一致
        { word: "我门", level: 18 },//给我门生态文明建设的启示。
        { word: "道路类问题", level: 18 },//此题属于道路类问题————道路→→ 道理。
        { word: "少数民族地区当家作主", level: 18 },//我国保障了少数民族地区当家作主的权利”改成“我国保障了少数民族地区人民当家作主的权利”。
        { word: "末强调", level: 18 },//未强调
        { word: "小在交友过程", level: 18 },//请你提醒小在交友过程中应注意哪些问题 雷
        { word: "币国国", level: 18 },//有利于人民币国国际化的进程 多一个“国”
        { word: "让权力的行使，", level: 18 },//只有加强对权力的监督，才能让权力的行使，
        { word: "地制宣", level: 18 },//因地制宣 “因地制宜”
        { word: "本题考查的主要知识点为： ", level: 18 },//本题考查的主要知识点为：
        { word: "故故", level: 18 },//故故D正确
        { word: "书本和比", level: 18 },//接触到书本和比等物品
        { word: "不错坏事", level: 18 },//多做善事，不错坏事
        { word: "珍借", level: 18 },//珍借中医古老瑰宝
        { word: "权力义务相统一", level: 18 },//割裂了权力义务相统一的关系
        { word: "个人经济", level: 18 },//还存在个人经济、私营经济等非公有制经济。  个体
        { word: "考回报", level: 18 },//本题主要考回报父母
        { word: "其某", level: 18 },//张其某的行为是错误的
        { word: "润海派出", level: 18 },//润海派出所”，改为：洱海派出所
        { word: "老岭", level: 18 },//人口老岭化
        { word: "体味美好", level: 18 },//体味美好情感
        { word: "洹", level: 18 },//而洹 增强军事实力
        { word: "朦胧情素", level: 18 },//朦胧情素 情愫
        { word: "嫩提", level: 18 },//白嫩提是对精神文明建设的考查
        { word: "利，于", level: 18 },//有利，于
        { word: "村落得修缮", level: 18 },//争取各方资源用于传统古村落得修缮维护
        { word: "育于特殊", level: 18 },//矛盾的普遍性孕育于特殊性之中 寓        
        { word: "我长期坚持一项基本国策", level: 18 },//
        { word: "是我长期坚持的一项基本国策", level: 18 },//而对外开放是我长期坚持一项基本国策 我改为我国
        { word: "增经济增长", level: 18 },//实现促进增经济增长
        { word: "建设现代化经济体。", level: 18 },//建设现代化经济体。
        { word: "资源约", level: 18 },//形成资源约
        { word: "民主平等", level: 18 },//  民族
        { word: "政府要依法执政", level: 18 },//政府要依法执政 改为 政府要依法行政
        { word: "增强无法自信", level: 18 },//增强无法自信，无法改为文化
        { word: "抄袭别人的作用", level: 18 },//抄袭别人的作用————作用→→作业
        { word: "有哪几部分组成", level: 18 },// 由
        { word: "抗议中", level: 18 },//中国抗议抗议中
        { word: "要求要求", level: 18 },//并要求要求各级党委 去掉一个“要求
        { word: "以实际性向", level: 18 },//以实际性向英雄学习
        { word: "维护国家安是我们的共同责任", level: 18 },//  雷
        { word: "有民主选举产生", level: 18 },//人民代表大会的代表有民主选举产生
        { word: "政府法职", level: 18 },//规定了政府法职权范围
        { word: "题可以宪法产生", level: 18 },//本题可以宪法产生政府，改为：本题可以从宪法产生政府，
        { word: "有平静变得", level: 18 },//情绪有平静变得浮躁，焦虑；
        { word: "生要作用", level: 18 },//充分发挥社会主义协商民主的生要作用；错字重要作用
        { word: "无竞派", level: 18 },//国工商联和无竞派人士的意见 党派
        { word: "建康", level: 18 },//生命建康
        { word: "弓虽", level: 18 },// 增弓虽法律意识和安全意识,
        { word: "的义可", level: 18 },//礼让斑马线”的义可从生命健康权
        { word: "人民代表大会委员会", level: 18 },//和全国人民代表大会委员会的决定 
        { word: "影力", level: 18 },//扩大国有经济的影力和抗风险能力。
        { word: "宪法则", level: 18 },//宪法则”改成“宪法原则”
        { word: "赶到非常", level: 18 },//他赶到非常烦恼
        { word: "在阶级社会中，价值判断和价值选择具有阶级性", level: 18 },// 雷 BC 正确
        { word: "承担相信的处罚", level: 18 },//说明公民需要为自己的违法行为承担相信的处罚；
        { word: "社会主义市场经济的主要组成部分", level: 18 },//是社会主义市场经济的主要组成部分 重要
        { word: "那那", level: 18 },//那那么1件商品的价值量为
        { word: "革的历史", level: 18 },//两国革的历史背景、阶级力量对比
        { word: "对外开放的形式", level: 18 },//以便更好地适应我国对外开放的形式————形式→→形势
        { word: "围绕监察职责", level: 18 },//监察委员会行使的职责围绕监察职责、调查职责 监察职责→→监督职责
        { word: "主要考查本题", level: 18 },//本题主要考查本题主要考查
        { word: "态度而和", level: 18 },//落实情感态度而和价值观目标————而，删。 
        { word: "考查：时事政治", level: 18 },//本题考查时事政治。不需要冒号，如果是教材知识点的话可以加冒号
        { word: "分被任命", level: 18 },//分被任命唐一军为司法部部长等 分别
        { word: "市场经济体质", level: 18 },//发挥社会主义市场经济体质的作用：
        { word: "靠法律保障法律", level: 18 },//人民权益要靠法律保障法律——————第2个法律，删
        { word: "知识点为：时事政治", level: 18 },//本题考查的主要知识点为：时事政治。→→本题考查时事政治。 理由：新审核标准要求。
        { word: "；政治协商制度", level: 18 },//“政治协商制度”改成“中国共产党领导的多党合作和政治协商制度”
        { word: "孔子说春秋时期", level: 18 },//B，孔子说春秋时期的大教育家 雷
        { word: "航空制造产业属于该科技产业", level: 18 },//②项，航空制造产业属于该科技产业
        { word: "国特社", level: 18 },//
        { word: "特社会", level: 18 },//是中国特社会主义制度的最大优势
        { word: "关进制度法笼", level: 18 },//把权力关进制度法笼子里
        { word: "青少人格", level: 18 },//健全青少人格。
        { word: "进化贸易", level: 18 },//提高进化贸易便利化 进化 改成进口
        { word: "知识点为：进出口", level: 18 },//【解析】本题考查的知识点为：进出口 知识点错误，应该是汇率变动的影响，
        { word: "证依法", level: 18 },//有利于证依法行使权力
        { word: "加人了", level: 18 },// 入
        { word: "中国雨联", level: 18 },//本题是对中国雨联合国关系的考查
        { word: "台法的", level: 18 },// 合法的
        { word: "向穆冲", level: 18 },//就像赛马一样向穆冲
        { word: "并发出巨", level: 18 },//
        { word: "在于同伴的", level: 18 },//在于同伴的互学共进中增长才干————于→→与
        { word: "图片的进行判断", level: 18 },//本题首先对两幅图片的进行判断分析，——————的，删。
        { word: "得以于", level: 18 },//停课不停学得以于强大的互联网支撑，
        { word: "发过国家", level: 18 },//发过国家集中人力 发挥国家
        { word: "可以从根据素材", level: 18 },//本题可以从根据素材中
        { word: "公告管理", level: 18 },//降低公告管理成本 改为：降低公共管理成本
        { word: "政府法建设", level: 18 },//推动法治政府法建设
        { word: "法律权赋予", level: 18 },// 法律赋予
        { word: "末经", level: 18 },//
        { word: "锁住小区", level: 18 },//及锁住小区的人们
        { word: "的意见的意见", level: 18 },//的意见的意见
        { word: "兹事", level: 18 },//
        { word: "寻畔", level: 18 },//寻畔兹事
        { word: "考查效制约", level: 18 },//本题主要考查效制约”，改为：本题主要考查有效制约
        { word: "当出现不良情绪是", level: 18 },//当出现不良情绪是，我会转移一下注意力，听听音乐、看看电视剧等来放松自己，缓解紧张的情绪。————是→→时；“会”后加：通过
        { word: "客服困难", level: 18 },//自强有助于我们客服困难
        { word: "政府官员应对疫情不力而免责", level: 18 },// 雷
        { word: "中国共产的", level: 18 },//中国共产的性质和地位
        { word: "的从设问", level: 18 },//本小题的从设问方向上看，的去掉
        { word: "故正确", level: 18 },//
        { word: "故错误", level: 18 },//故错误。
        { word: "积极积极", level: 18 },//需要公民以积极积极作为的国家主人公态度
        { word: "人民大表", level: 18 },//人民大表大会职权
        { word: "享受公民权利享受法律赋予的公民基本权利", level: 18 },//同样平等地享受公民权利享受法律赋予的公民基本权利
        { word: "为返其提供", level: 18 },//为返其提供免预约功能”改成“为其返校提供免预约功能”
        { word: "宪法宪法", level: 18 },//.说明了宪法宪法是……宪法，删。
        { word: "重要需改", level: 18 },//经历了三次重要需改 需改应该是 修改
        { word: "对人民负责的规则原则", level: 18 },//体现了政府对人民负责的规则原则 工作原则
        { word: "行使决定特色的职权", level: 18 },//我国宪法对特赦制度作出明确规定：全国人民代表大会常务委员会行使决定特色的职权；
        { word: "比法传统", level: 18 },//相比法传统剧院观看，法改为去
        { word: "国归党纪", level: 18 },//对违反国归党纪的人坚决依法严肃处理
        { word: "，及有利于", level: 18 },//，及有利于历史文化的保护，又有利于
        { word: "北不京市", level: 18 },//北不京市政府改为北京市政府
        { word: "强调的我国是", level: 18 },//且题干主要强调的我国是人民民主专政的社会主义国家
        { word: "八台大轿", level: 18 },//
        { word: "杜绝”一词说法过于绝，", level: 18 },//杜绝”一词说法过于绝， 雷
        { word: "疫情防空", level: 18 },//疫情防空兵未完全取得胜利
        { word: "公民的公民的", level: 18 },//公民的公民的”重复，删掉一个“公民的”
        { word: "互患", level: 18 },//包容互惠
        { word: "这是由我国现阶段的基本国情所决定的", level: 18 },//这是由我国现阶段的基本国情所决定的”改成“这是由我国的社会主义性质和现阶段的基本国情所决定的”。
        { word: "经营产略", level: 18 },//经营产略 柯达 雷
        { word: "总总书", level: 18 },//总总书记
        { word: "白强不息", level: 18 },//五千年白强不息，
        { word: "兴今世界", level: 18 },//兴今世界 当今世界
        { word: "部门门", level: 18 },//为相关部门门制定社会
        { word: "勤芳", level: 18 },//勇敢
        { word: "扯示", level: 18 },//扯示、有错别字
        { word: "箪", level: 18 },//简政放权改箪
        { word: "经建设", level: 18 },//
        { word: "年年益寿", level: 18 },//年年益寿；表述错误，延年益寿，
        { word: "带好口罩", level: 18 },//出门戴好口罩
        { word: "第一步社会主义宪法", level: 18 },//第一步社会主义宪法
        { word: "思雄", level: 18 },//思维特点
        { word: "抗议英雄", level: 18 },//要表达出对抗议英雄的尊重。
        { word: "分析我当在", level: 18 },//要求运用政治生活知识分析我当在应对疫情中发挥的 作用 我当 改为我党
        { word: "有合法的方式发泄", level: 18 },//有合法的方式发泄不良情绪。————有→→用
        { word: "集体的哺育和支持", level: 18 },//我们的成长离不开集体的哺育和支持——集体→家庭
        { word: "是放性", level: 18 },//本题是放性试题
        { word: "学习他人有点", level: 18 },//包容他人不同，学习他人有点； 优点
        { word: "人生价值的真正价值在于", level: 18 },//从人生价值的真正价值在于对社会的贡献、
        { word: "权利的监督", level: 18 },//
        { word: "赚取私立", level: 18 },//赚取私立，有错别字
        { word: "治理能力现代。", level: 18 },//
        { word: "治理能力现代，", level: 18 },//
        { word: "治理能力现代；", level: 18 },//推进国家治理体系和治理能力现代；
        { word: "积极配防疫", level: 18 },//④发现疫情，要及时报告，积极配防疫工作
        { word: "用法太过绝对", level: 18 },//用法太过绝对，“用法”，改为：说法
        { word: "与集体利益本质上是一致,", level: 18 },//
        { word: "与集体利益本质上是一致。", level: 18 },//在集体中，个人利益与集体利益本质上是一致。
        { word: "思维方式方面产生差异", level: 18 },//说明了男生与女生在兴趣爱好，思维方式方面产生差异 产生”改成“存在”
        { word: "中华优秀文化传统", level: 18 },//传承和发展中华优秀文化传统。 文化传统”改成“传统文化”
        { word: "的属领", level: 18 },//党的属领导”，改为：党的领导
        { word: "法律法律", level: 18 },//法律法律规范着全体社会成员的行为，
        { word: "而而", level: 18 },//都能受到公平而而有质量的教育
        { word: "位与", level: 18 }, //  counter  品位与潮流
        { word: "嚣", level: 18 },// 老年按摩嚣
        { word: "开张主题教育", level: 18 },//题目强调开张主题教育活动的意义和影响
        { word: "公民要增强公众对", level: 18 },//公民要增强公众对决策的理解
        { word: "人民检察维护", level: 18 },//人民检察维护个人和组织的合法权益————检察后加：院
        { word: "推动建新型国际关系", level: 18 },//雷
        { word: "小间", level: 18 },//第二小间 改为“第二小问”
        { word: "生态行关", level: 18 },//指引教育人们的生态行关等角度作答。 “关”改成“为”
        { word: "说明了说明", level: 18 },//说明了说明了检察机关依法公正行使检察权，
        { word: "的遵严", level: 18 },//也关系到国家的遵严和形象
        { word: "守法法", level: 18 },//有道德的人不一定会遵守法法律。
        { word: "发扬方有", level: 18 },//全国人民发扬方有难，八方支援的精神,
        { word: "行改许可", level: 18 },//行政许可
        { word: "浏苦", level: 18 },//努力使自己成为创新人才浏苦学习
        { word: "信营", level: 18 },//树立良好的信营和形象,改成树立良好的信誉和形象,
        { word: "的产主", level: 18 },//发展的实质是新事物的产主和旧事物的灭亡。 雷
        { word: "我们经达到", level: 18 },//我们经达到的小康是总体小康，
        { word: "取得切成就", level: 18 },//我们取得切成就和进步的根本保证
        { word: "相互关系，", level: 18 },//
        { word: "互相关系", level: 18 },//关心
        { word: "分溺类", level: 18 },//属于原因分溺类题目
        { word: "大力宣传力度", level: 18 },//社会媒体：要大力宣传力度，
        { word: "有国家权力机关产生", level: 18 },//有国家权力机关产生国家行政机关、
        { word: "提高良好的社会环境", level: 18 },//提高良好的社会环境·····”“提高”，应改为：提供。
        { word: "他既不能被创造", level: 18 },//他既不能被创造、也不能被消灭
        { word: "为涉及", level: 18 },//为涉及要反对“历史虚无主义”
        { word: "制度是的实质", level: 18 },//社会主义制度是的实质改为，社会主义制度的实质
        { word: "社会主义文明建设", level: 18 },//我们可以结合建设社会主义文明建设的相关知识组织答案”改成“我们可以结合建设社会主义精神文明的相关知识组织答案”。
        { word: "促进我国了", level: 18 },//促进我国了文化的传播和发展 改为 促进了我国文化的传播和发展
        { word: "监察国家监察权的", level: 18 },//行使监察国家监察权的机关是监察委员会”改成“行使监察权的国家机关是监察委员
        { word: "安生立世", level: 18 },// 安身立世
        { word: "满则感", level: 18 },//题干没有体现满则感……满足感。
        { word: "积极为疫情献计", level: 18 },//我国积极为疫情献计献策”改成“我国积极为防控疫情献计献策”
        { word: "权知力", level: 18 },//是我国政府权知力运行的依据，————知，删
        { word: "可以赢得到应有的回报", level: 18 },//可以赢得到应有的回报
        { word: "题要求运用说明", level: 18 },//
        { word: "只能有公司发行", level: 18 },//
        { word: "根据提意", level: 18 },//根据提意
        { word: "。蒙古自治区", level: 18 },//
        { word: "材料种", level: 18 },//材料种孔孟之道
        { word: "现刑法律", level: 18 },// 刑事违法行为，是指违反国家现刑法律规定
        { word: "和防未成年人", level: 18 },//我国颁布了未成年人保护法和防未成年人犯罪法等专门法律未成年人特殊关爱和保护。
        { word: "辩证的否定否定", level: 18 },//辩证的否定否定是旧事物中不合理因素
        { word: "要从从", level: 18 },//并限定要从从，改为：并限定要从
        { word: "感思", level: 18 },//我们应该学会感恩
        { word: "发展的不平衡，不充分", level: 18 },//发展的不平衡，不充分之间的矛盾。……不平衡不充分的发展之间的矛盾。
        { word: "法制责任", level: 18 },//
        { word: "上迷观点", level: 18 },//上迷观点”，改为：上述观点
        { word: "每个人都智慧", level: 18 },//需要每个人都智慧和力量
        { word: "本题考查的主要知识点为：增值税", level: 18 },   //  增值税 雷   具体不明 据说未跳弹框  。暂时按书本知识点处理
        { word: "法定义务的承担着", level: 18 },//又是法定义务的承担着
        { word: "党的政治理念", level: 18 },//本题从国家性质、党和政府的宗旨、党的政治理念……政治理念→执政理念
        { word: "正确面认识", level: 18 },//瑶瑶应正确面认识自己，悦纳自己
        { word: "【答案】 正确", level: 18 },//“【答案】 正确”，改为：【答案】 D
        { word: "收到表彰或奖励", level: 18 },//收到表彰或奖励时 收”改成“受”。
        { word: "我的国的", level: 18 },//它是我的国的，改为：它是我国的
        { word: "少年有之则国振兴", level: 18 },//少年有之则国振兴————有之→→有志。
        { word: "更作用现象", level: 18 },//“有男生出现是，自己会更作用现象”  注意形象
        { word: "，其他法律根据宪法制定的", level: 18 },//其他法律根据宪法制定的……法律后加：是
        { word: "宪法是其他法律的基础", level: 18 },//宪法是其他法律的基础和立法依据”改成“宪法是其他法律的立法基础和立法依据”。
        { word: "本根据所学", level: 18 },//本根据所学知识
        { word: "此两种", level: 18 },//然后调动知识回答此两种选举方式划分的依据。
        { word: "消费才是的消费", level: 18 },//而是消费才是的消费受求实心理的影响
        { word: "没有没有", level: 18 },//材料没有没有体现这一内容，
        { word: "同票问权", level: 18 },//实现城乡“同票问权” 同权
        { word: "这斌不是", level: 18 },//但这斌不是人民代表大会制度的基本内容
        { word: "中国中央", level: 18 },//中共中央 民主党派向中国中央及人民政协提交建议和信息
        { word: "劳动权权", level: 18 },//原工作单位侵犯了小文叔叔的劳动权权”应为“原工作单位侵犯了小文叔叔的劳动权”
        { word: "包括，", level: 18 },//“，”改成“：”
        { word: "追求公民", level: 18 },//追求公民有利于使人们能公正、平等地对待周围的 ”，“公民”应改为“公平”
        { word: "承当更多", level: 18 },//并不会使中国承当更多义务
        { word: "际规陋习", level: 18 },//陈规陋习
        { word: "保障保障", level: 18 },//因此其开放有利于保障保障人民群众的基本文化权益，去掉一个保障
        { word: "经济体化", level: 18 },//坚持推进区域经济体化，改为：坚持推进区域经济一体化，
        { word: "共产党成立100年时", level: 18 },//中国共产党成立100年时，全面建成小康社会参考九年级上册106页 答案（2）应为：到建党一百年时，全面建成小康社会；到新中国成立一百年时，全面建成社会主义现代化强国。
        { word: "疫情防疫", level: 18 },//
        { word: "同违法行为斗争", level: 18 },//同违法行为斗争”改成“同违法行为作斗争”
        { word: "主义从实际出发", level: 18 },//应该主义从实际出发，“主义”？
        { word: "组织社会文化建设的职能", level: 18 },//政府应履行组织社会文化建设的职能 改为 政府应履行组织社会主义文化建设的职能
        { word: "青春烦恼", level: 18 },//
        { word: "青春的心理变化", level: 18 },//青春期
        { word: "司法机对", level: 18 },//可以看出这体现了司法机对有违法犯罪行为的未成
        { word: "注重了系统内部结构的优化趋向", level: 18 },// 了解整个系统， 雷 注重了系统内部结构的优化趋向，故④正确。
        { word: "如 ", level: 18 },//
        { word: "一心为名", level: 18 },// 为民
        { word: "被被", level: 18 },//,被被交警扣分罚款
        { word: "没有体现序参与", level: 18 },//没有体现序参与政治生活，
        { word: "同事我们也", level: 18 },//同事我们也渴望得到异性的肯定和接受
        { word: "人民贬值后", level: 18 },// 雷
        { word: "法制意识", level: 18 },//树立法制观念，增强法制意识， 有错别字，请修改。法治
        { word: "基础群众性自治", level: 18 },//是我国的基层群众性自治组织，
        { word: "我国基本制度", level: 18 },//本题主要考查我国基本制度的相关知识 表述不准确，建议把“基本制度”改成“政治、经济制度
        { word: "建成全面深化改革", level: 18 },//建成全面深化改革 “建成”改成“坚持”
        { word: "的主要是点", level: 18 },//本题考查的主要是点为：改为解析】本题考查的主要知识点为：
        { word: "道德与法制", level: 18 },//道德与法制，“法制”应改为“法治”
        { word: "围观考查", level: 18 },//属于围观考查改为属于微观考查
        { word: "实现脱贫致富公平", level: 18 },//实现脱贫致富公平是提高经济效率的保证。让贫困户分享企业发展红利 改为 实现脱贫致富。公平是提高经济效率的保证，
        { word: "感到中国", level: 18 },//“感到中国”
        { word: "不是有国有经济决定", level: 18 },//而不是有国有经济决定的 改为 而不是由国有经济决定的
        { word: "人民调节委员会", level: 18 },//人民调节委员会
        { word: "，大代表", level: 18 },//
        { word: "；大代表", level: 18 },// ；大代表应密切联系群众
        { word: "传统文艺术", level: 18 },//材料没有体现对传统文艺术的继承
        { word: "这一一", level: 18 },// 围绕政府这一一政治生活的主体
        { word: "的主义知识点", level: 18 },//本题考查的主义知识点为 主义改为主要
        { word: "的知，", level: 18 },// 本题主要考查国有经济的地位、作用的知，
        { word: "载人了", level: 18 },//宪法修正案中载人了
        { word: "XXXX", level: 18 },//
        { word: "社台主义", level: 18 },// 走中国特色社台主义文化发展道路  雷
        { word: "公民意志的直接反应", level: 18 },//不是公民意志的直接反应 改为：直接反映，
        { word: "农民社生活", level: 18 },// 农民社生活质量提高
        { word: "目我感觉", level: 18 },//如良好的目我感觉、
        { word: "属于教材知识", level: 18 },//属于教材知识 知识前加：基础
        { word: "；多党合作", level: 18 },// 多党合作删加：中国共产党领导的
        { word: "从这里可以看出我国的国家性质是什么", level: 18 },//从这里可以看出我国的国家性质是什么 国家性质是什么……是什么，删。
        { word: "国家治理体和治理", level: 18 },// 根本要不断推进国家治理体和治理能力现代化。
        { word: "时间对认识的作用", level: 18 },//所以要重视时间对认识的作用 时间改为实践
        { word: "公在行使权利", level: 18 },// 公在行使权利时，不得损害国家的、社会
        { word: "20 9", level: 18 },//20 9年2月 27日再次会晤 改为 2019年2月 27日再次会晤
        { word: "扎棍人民", level: 18 },// 立志扎棍人民、奉献国家
        { word: "贫闲人口", level: 18 },//加强贫闲人口技能培训，激发扶贫对象
        { word: "主动招当", level: 18 },// 主动招当、攻坚克难。 担当
        { word: "勤合学习", level: 18 },//勤合学习  勤奋
        { word: "最美道行者", level: 18 },//展现了“最美道行者”的家国情怀
        { word: "舍已救人", level: 18 },//
        { word: "特色知社会主义", level: 18 },//我国开辟了中国特色知社会主义道路，
        { word: " C.抢夺方向盘是法律禁止做的事，不是法律要求做的事，故D选项", level: 18 },// 雷 C.抢夺方向盘是法律禁止做的事，不是法律要求做的事，故D选项错误。
        { word: "革除生活习", level: 18 },//革除生活习，
        { word: "与自然和诺共生", level: 18 },// 实现人与自然和诺共生；
        { word: "对导致信任危机", level: 18 },//失信于人，会导致信任危机
        { word: "规律规律", level: 18 },// 上层建筑一定要适应经济基础是社会发展的客观规律规律
        { word: "强刺性", level: 18 },//法定义务是由我国宪法和法律规定的，具有强刺性。
        { word: "价值体体系", level: 18 },// 社会主义核心价值体体系 去掉一个“体”
        { word: "说开展这一活动", level: 18 },//说开展这一活动 改为 说明开展这一活动
        { word: "坚信疫情一定能战胜", level: 18 },// 坚信疫情一定能战胜”改成“坚信疫情一定能被战胜
        { word: "体现了人类命运共同体的重要举措", level: 18 },//体现了人类命运共同体的重要举措
        { word: "毫不动程", level: 18 },// |毫不动程鼓励
        { word: "合理开放自然", level: 18 },//应该合理开放自然资源，开放改为开发
        { word: "坚如謦石", level: 18 },// 夺取反腐斗争压倒性胜利的决心坚如謦石  雷
        { word: "主观与客现", level: 18 },//都是主观与客现具体的历史的统一
        { word: "主现与客", level: 18 },//
        { word: "和碰商", level: 18 },//中方始终坚持,分歧和摩擦最终需要通过对话和碰商来解决
        { word: "更心有利于", level: 18 },// 更心有利于解决问题。改为：更有利于解决问题。
        { word: "全球化化", level: 18 },//从经济全球化化、
        { word: "属于围观考查", level: 18 },// 属于围观考查改为属于微观考查
        { word: "有审批权", level: 18 },// 法院 审判
        { word: "的知识的知识", level: 18 },// 的知识的知识
        { word: "构成事物要素排列次序和结构发生变化时", level: 18 },//构成事物要素排列次序和结构发生变化时雷
        { word: "推倭", level: 18 },// 不得懈怠、推倭
        { word: "作有担当的", level: 18 },//作有担当的人”修改为“做有担当的人”
        { word: "的允许效率", level: 18 },// 提高国有企业的允许效率和管理的科学性
        { word: "在与创造", level: 18 },//伟大在与创造和贡献
        { word: "另方面", level: 18 },//一方面各民族都有自己的历史和文化;另方面
        { word: "《和我的祖国》", level: 18 },// 影片《和我的祖国》上映
        { word: "公正行使权利", level: 18 },//公正行使权利
        { word: "¨", level: 18 },// 今年的¨3.15″晩会曝光了
        { word: "发展农村村", level: 18 },//有利于解放和发展农村村社会生产力 去掉一个“村”
        { word: "锻炼十部", level: 18 },//习近平指出基层实践是培养锻炼十部的“练兵场” 十部改为干部
        { word: "培养十部", level: 18 },//
        { word: "共同发居", level: 18 },// 才能使世界各国共同发居 发居 改为 发展
        { word: "我国已经全面开放的新格局", level: 18 },//我国已经全面开放的新格局 改为 我国已经形成全面开放的新格局
        { word: "无关无关", level: 18 },// 雷
        { word: "我国的项基本", level: 18 },// 基层群众自治制度是我国的项基本政治制度 项改为一项
        { word: "尊重人际交往的前提", level: 18 },//尊重人际交往的前提和基础”改成“尊重是人际交往的前提和基础”。
        { word: "坚持改革开放是我们的强国之路", level: 18 },// 坚持改革开放是我们的强国之路 改革开放是强国之路，把“坚持”删掉。
        { word: "在国际社会中上发", level: 18 },// 中国在国际社会中上发挥着越来越重要的作用
        { word: "项正错", level: 18 },//故④项正错误
        { word: "题是对分析说明类题", level: 18 },// 本题是对分析说明类题目，把对去掉
        { word: "害观规律", level: 18 },// 只有遵循时代发展的害观规律 有错别字，请修改。
        { word: "一直呼就求助", level: 18 },//一直呼就求助 雷
        { word: " 【答案】", level: 18 },// 从【答案】开始要另起一行。
        { word: "需求的建设", level: 18 },// 伴随猪肉需求的建设
        { word: "权利与义务的关心", level: 18 },//从权利与义务的关心
        { word: "促使国内企业在国际竞争中自主创新地位", level: 18 },// 促使国内企业在国际竞争中自主创新地位 不通顺
        { word: "的做用", level: 18 },//②我国在国际舞台上发挥着越来越重要的做用。
        { word: "是反映强烈", level: 18 },// “反映强烈”修改为“反应强烈”
        { word: "价值观价值观", level: 18 },//强调价值观价值观引导 重复内容请删除
        { word: "天穷无尽", level: 18 },// 无穷无尽
        { word: "法规痛惜", level: 18 },// 做好配套的法律法规痛惜。
        { word: "接受思想政治受", level: 18 },//接受思想政治受洗礼
        { word: "遗产产", level: 18 },// 更好地发挥农业文化遗产产的现实价
        { word: "错正确", level: 18 },//故A错正确；改为：故A正确；
        { word: "，，", level: 18 },//
        { word: ",，", level: 18 },// 2逗号也判
        { word: "，,", level: 18 },//
        { word: "调调整", level: 18 },// 存贷款利率调调整 多一个“调”
        { word: "无力可图", level: 18 },// 市场主体感到无力可图，
        { word: "认识认识", level: 18 },//有利于中学生正确认识认识国家性质
        { word: "扶捆", level: 18 },// 扶捆帮学活动，改为：扶困帮学活动
        { word: "展现另风貌", level: 18 },//展现另风貌  雷
        { word: "更加热爱生活情趣", level: 18 },// 从而使人更加热爱生活情趣……情趣，删
        { word: "以为素材", level: 18 },// 题目以为素材 素材呢？
        { word: "罾", level: 18 },//,受它监罾,对其负责。
        { word: "体现出是青春", level: 18 },// 雷
        { word: "制造和传播谣言", level: 18 },// 雷
        { word: "括泼", level: 18 },//让学生在生动括泼、形式多样
        { word: "进步明确了", level: 18 },// 法律进步明确了 公民享有的各项具体权利，进步”改成“进一步
        { word: "不及代价", level: 18 },//不及代价与回报的奉献精神，
        { word: "这体现了是", level: 18 },// 这体现了是产生优秀文化作品的源泉 改为 这体现了社会实践是产生优秀文化作品的源泉
        { word: "政府了坚", level: 18 },// 政府了坚持依法行政
        { word: "盲目攀大", level: 18 },//M村红白喜事盲目攀大操大办陋习盛行，
        { word: "合符法", level: 18 },// 是合符法律要求的 应该是符合法律要求，
        { word: "合符要求", level: 18 },//
        // { word: "决讼争", level: 18 },// 在当事人和其他诉讼参与人的参加下，依法解决讼争的活动 ” “讼争”？？
        { word: "按规律的重要性", level: 18 },// 题意旨在强调尊重规律，按规律的重要性 改成按规律办事的重要性
        { word: "经济得生产", level: 18 },// 集体经济得生产资料属于部分劳动者共同所有;
        { word: "足促进", level: 18 },//倡议足促进世界经济发展的重要动力
        { word: "特色受主义", level: 18 },// 雷 中国特色受主义新时代开启了全面深化改革的新征程，
        { word: "建全基本社会保障", level: 18 },// 建全基本社会保障制度”修改为““健全基本社会保障制度””
        { word: "不能完善国家", level: 18 },//不能完善国家法律体系“ 不能 改为 不断
        { word: "是人大是国家", level: 18 },// 是人大是国家机关监督 改为 是人大对国家机关监督
        { word: "共和国治安处罚法", level: 18 },// 《中华人民共和国治安处罚法》改成《中华人民共和国治安管理处罚法》。
        { word: "进打举报", level: 18 },//有关部门进打举报……进打，删
        { word: "世界多极仪", level: 18 },//  体现了和平与发展的背景下世界多极仪趋势深入发展 世界多极仪 改为 世界多极化
        { word: "体现了贡献发展理念", level: 18 },// 这体现了贡献发展理念， “贡献”改成“共享”。
        { word: "表现形式在我国，", level: 18 },//表现形式在我国，
        { word: "不仅自己的缺陷", level: 18 },// 不仅自己的缺陷 不因
        { word: "根据材料概况", level: 18 },//是高度概括题根据材料概况主题思想，
        { word: "实施用口罩", level: 18 },// 政府实施用口罩统一管理、统一调拨 最后一句话去掉用
        { word: "个人利益于人民群众利益", level: 18 },// 当个人利益于人民群众利益发生矛盾时 于 改为 与
        { word: "；律禁止做的", level: 18 },//律禁止做的坚决不做。律前加：法。
        { word: "，律禁止做的", level: 18 },//
        { word: "身体康", level: 18 },//威胁人民生命安全和身体康
        { word: "宪法是国际", level: 18 },// 宪法是国际根本大法————国际改成：国家
        { word: "关键司", level: 18 },// 从材料、设问的关键司和材料呈现的措施中去归纳。
        { word: "被追求法律", level: 18 },//材料中空姐李某因逃税而被追求法律责任 追求 改为 追究
        { word: "我攻宪法", level: 18 },// 这说明我攻宪法是人民意志的集中体现
        { word: "是度人", level: 18 },//拥护社会主义的爱国者和拥护祖国统一的爱国者的联盟是度人民民主专政的社会基础
        { word: "说明学为", level: 18 },// 材料旨在说明学为具体科学提供方法论指导，C改成哲学
        { word: "拥有拥有", level: 18 },// 说明要想拥有拥有珍贵的品质或者美好的才华就需要不断的努力修炼
        { word: "说明做越", level: 18 },//说明做越接近成功越要认真对待，
        { word: "创新性转化和创造性发展", level: 18 },// 推动中华优秀传统文化创新性转化和创造性发展 创新性转化和创造性发展 改为 创造性转化和创新性发展
        { word: "共同来自共同的目标", level: 18 },//说明集体的力量共同来自共同的目标
        { word: "结合新闻实时", level: 18 },// 本题属于举例类时政考查题，只要结合新闻实时举相关例子即可。————实时改成：时事。
        { word: "克争", level: 18 },//科技创新能力已经成为综合国力克争的决定性因素————克争改成：竞争
        { word: "意谓", level: 18 },// 谓改成“味”
        { word: "使依法治国的具体", level: 18 },// 加强问责力度使依法治国的具体表现————使改成：是
        { word: "文化多样对", level: 18 },//材料没体现文化多样对文化创新的作用 “文化多样性”
        { word: " 解答此题解答", level: 18 },// 解答此题解答此题需熟记并
        { word: "独体优势", level: 18 },// 答案（3）中“独体优势”改为“独特优势”。
        { word: "的个价值", level: 18 },//社会主义核心价值观的个价值准则 ，——个改成：个人层面
        { word: "是种道德", level: 18 },// （2）是种道德规范和品质——种前加：一
        { word: "使共利益", level: 18 },//就是使共利益最大化的社会管理过程 共利益 改为 公共利益
        { word: "喜观存在", level: 18 },// 都是对喜观存在的不同程度的歪曲反 映 喜观 改为 客观
        { word: "赢遵守", level: 18 },//在食堂打饭要排队是我们赢遵守的基本规则——————赢改成：应
        { word: "现化发展", level: 18 },// 未体现化发展繁荣必须坚持百花齐放、百家争鸣的方针 化发展 改为 文化发展
        { word: "坚持坚持", level: 18 },// 能否坚持坚持和完善社会主义市场经济 删掉一个“坚持”
        { word: "要提眼", level: 18 },//公民需要提眼力，
        { word: "公要", level: 18 },// 自媒体公要将社会效益放在首位
        { word: "世世代相", level: 18 },//传统文化在世世代相传中保留着基本特征
        { word: "继承和扬", level: 18 },//我们要继承和扬中华优秀传统文化
        { word: "塑造者我", level: 18 },//塑造者我们的人格。  着
        { word: "文化多样对", level: 18 },//料没体现文化多样对文化创新的作用 “文化多样性”
        { word: "的因为", level: 18 },// 西安打响“蓝天保卫战”的因为环境污染治理已经是人民群众的迫切愿望，
        { word: "敢于对合理的事情说", level: 18 },// 敢于对合理的事情说“不”，  不合理
        { word: "贯策", level: 18 },//有利于推进人们对法律法规的遵守和贯策执行
        { word: "中是华", level: 18 },// 是因为爱国主义中是华民族精神的核心，
        { word: "协商的重要结构", level: 18 },//中国人民政治协商会议是我国多党合作和政治协商的重要结构，
        { word: "选举和被选举权", level: 18 },// 我国公民基本的民主权利是选举和被选举权 表述欠妥，应该是选举权和被选举权，，
        { word: "人民达标大会", level: 18 },// 全国人民达标大会常务委员会的决定，
        { word: "人大达标", level: 18 },//
        { word: "题中观点中的正确与否", level: 18 },// 考查学生辨别分析问题的能力回答。解答本题要首先判断题中观点中的正确与否————回答，删除。————观点中的“中”，删除
        { word: "分析问题的能力回答", level: 18 },//
        { word: "提升思想引。", level: 18 },//把学习当作"磨刀石"，提升思想引。
        { word: "宜誓", level: 18 },// 进行宪法宜誓”，改为：进行宪法宣誓。
        { word: "宣暂", level: 18 },//
        { word: "真苯", level: 18 },//真苯  雷
        { word: "原有事务", level: 18 },// 当我们产生消极情绪时，可以通过改变对原有事务的认知”，
        { word: "在精神是", level: 18 },// 在精神上关心父母
        { word: "文化塑造认识", level: 18 },//运用文化塑造认识的有关知识”回答 认识改为人生
        { word: "市可有利于", level: 18 },// 建文明城市可有利于提高公民自身道德修养”
        { word: "等的品", level: 18 },// 百折不挠，团结一心等的品质 的”删掉  等的  平等的
        { word: "法治对权力", level: 18 },//要加强法治对权力的制约和监督 两处的“法治” 改为 “法制”
        { word: "授子", level: 18 },// 授子国家的勋章和荣誉称号。
        { word: "青春飞翔", level: 18 },//我们需要结合教材青春飞翔的相关知识
        { word: "灵活贯通", level: 18 },// 灵活贯通，改为：融会贯通
        { word: "和不平稳", level: 18 },// 美好生活需要和不平稳 修改为美好生活需要和不平衡
        { word: "人民当家作主的权力", level: 18 },//
        { word: "践行社会主义价值观", level: 18 },// 把“践行社会主义价值观”改成“践行社会主义核心价值观”。
        { word: "科、学", level: 18 },// 科学立法
        { word: "不良因素的影和", level: 18 },//容易受到不良因素的影和不法侵害，
        { word: "勇扰重", level: 18 },// 勇扰重担、
        { word: "必须做到遵德守法，故D选项错误。", level: 18 },// 雷
        { word: "法是切", level: 18 },// 宪法是切组织和个 人的根本活动准则
        { word: "末成年", level: 18 },// 未成年
        { word: "一次与关法律", level: 18 },//题目以某校七年级（1）班同学组织了一次与关法律的一系列探究性活动为素材
        { word: "当时不能损害", level: 18 },// 但是不能
        { word: "建请", level: 18 },// 雷 邀请
        { word: "实行居民自治不等于享有自治权，", level: 18 },//
        { word: "有填权", level: 18 },//有填权    提案权
        { word: "主义主义", level: 18 },// ②题干中“祈求神灵保佑”的观点属于客观唯心主义主义观点，
        { word: "知识点为 ", level: 18 },//
        { word: "知识点 ", level: 18 },//
        { word: "班级体建设", level: 18 },// 为班级体建设建言献策；
        { word: "项中正确", level: 18 },// 故②项中正确；
        { word: "体现了这体现", level: 18 },// 这体现了这体现了生命是坚强的、
        { word: "体现了体现", level: 18 },//
        { word: "造不幸", level: 18 },// 女乘车突造不幸————造→→遭
        { word: "应必须", level: 18 },//但我们应必须遵守学校规则————应、必须，2选1删
        { word: "华族", level: 18 },// 迎来了中国华族 改为 迎来了中华民族 圈4 调整生产关系与知生产力 删掉“知”
        { word: "才有才有", level: 18 },// 因此有人认为良法之下才有才有法治国家的说法有一定合理性
        { word: "是非曲折", level: 18 },// 明辨是非曲折的能力————折→→直
        { word: "没有抢到", level: 18 },// 没有抢到，改为：没有强调
        { word: "影响抗议", level: 18 },// 影响抗议秩序
        { word: "威绩", level: 18 },//5年后，威绩优异的她大学毕
        { word: "法制建设", level: 18 },// 社会主义法制建设
        { word: "告表", level: 18 },// 网友通过人民网对政府工作报告表了自己的看法意见，MistyRose 浅浅红
        { word: "的看看谁", level: 18 },// 我们现在的目标是如何提高成绩，而不是一味的看看谁漂亮。
        { word: "量进步", level: 18 },// 中国经济在世界经济中的分量进步增大
        { word: "认真学校", level: 18 },// 小慧在学校认真学校————第2个“学校”→学习
        { word: "高不开", level: 18 },// 世界的繁荣也高不开中国————高，离。
        { word: "组都", level: 18 },// 考生可以从“行己有耻”这一角度入手呢组都即可。改成“作答”。
        { word: "说梦", level: 18 },// 本题属于分析说梦类题目，
        { word: "融人", level: 18 },// 将中医药文化融人全球语
        { word: "病毒毒", level: 18 },// 人们对新型冠状病毒毒战胜过程也是逐步实现
        { word: "小手机", level: 18 },// 小手机进军印度市场改为小米手机进军印度市场
        { word: "以人民为安全为宗旨", level: 18 },// 我国国有有企业在关键行业，改为我国国有企业在关键行业
        { word: "本题主要考查 ", level: 18 },//
        { word: "本题主要考查。", level: 18 },//
        { word: "但材料强调的主体是企业，故③正确。", level: 18 },// 雷 但材料强调的主体是企业，故③正确。
        { word: "基因系列", level: 18 },// 冠状病毒基因系列信息
        { word: "对自己负贵。", level: 18 },//
        { word: "可从从", level: 18 },// 考生可从从”，改为：考生可从。
        { word: "国清", level: 18 },//  基本国情
        { word: "额考", level: 18 },// 本题是对中国特色社会主义文化的额考查
        { word: "彼止", level: 18 },//.宽容让彼止宽待→宽容让人们彼此宽待。 止→此。
        { word: "建设国中心", level: 18 },// 决定我国要以经济建设国中心，
        { word: "学习其它文明听优秀成果", level: 18 },//
        { word: "分字", level: 18 },//
        { word: "以宪执政", level: 18 },//
        { word: "市民正常生受到影响", level: 18 },//
        { word: "对外开发", level: 18 },//
        { word: "实行三权权立原则", level: 18 },//
        { word: "仪表灯外在", level: 18 },// 过分追求形体、仪表灯外在美，
        { word: "主觉", level: 18 },// 调动其履行义务的积极性和主觉承担对国家和社会的责任。
        { word: "达成彼此的理解和包容", level: 18 },//  雷？  对彼此包容理解
        { word: "主要的主要", level: 18 },//
        { word: "中国答先进", level: 18 },// 代表中国答先进文化的前进方向，。。。党的最高理想和最终目标是实现共产主版义
        { word: "共产主版", level: 18 },//
        { word: "国家意体现", level: 18 },// “国家意体现” 改为 ②，“国家意志的体现”
        { word: "多党合作与政治协商", level: 18 },//中国共产党领导的多党合作与政治协商制度
        { word: "前握提", level: 18 },// 科学执政是基本前握提 前握提 改为 前提
        { word: "通由行使", level: 18 },// 总统可以通由行使议案否决权来控制国会 通由改为通过
        { word: "资本阶级", level: 18 },// 民主党与共和党都是资本阶级政党 资本改为资产
        { word: "行使权利公民权利", level: 18 },//要在法律允许的范围内行使权利公民权利
        { word: "扩宽", level: 18 },// 扩宽民主渠道 改为 拓宽民主渠道
        { word: "促进保持", level: 18 },// 促进保持良好的心态——促进，删
        { word: "唯有此气", level: 18 },//）理生万物，唯有此气，已有此理。未有这事，先有这理。
        { word: "做好做好", level: 18 },// 认真做好做好防护措施
        { word: "唯主义", level: 18 },// 要坚持历史唯主义，  雷
        { word: "司法公正正义", level: 18 },// “公正正义”改为“公平正义”。
        { word: "要要", level: 18 },//还要要考虑他人的感受，
        { word: "后面的一次是", level: 18 },// 排在它后面的一次是房产 改为“排在它后面的依次是房产”
        { word: "发布命令全", level: 18 },// 发布命令全 “权”
        { word: "反映的了", level: 18 },// 题干反映的了青少年的各种心理矛盾，
        { word: "现会会", level: 18 },//个人正当利益的实现会会促进集体的发展，
        { word: "中国共产党是中国共产党", level: 18 },// 中国共产党是中国共产党是中国工人阶级的先锋队，
        { word: "法律的制订", level: 18 },//其它法律的制订都是以其作为标准的”应为“其它法律的制定都是以其作为标准的”
        { word: "规律规律", level: 18 },// 材料强调绘画创作是有规律规律可循的
        { word: "健康委会", level: 18 },// 黄冈市卫生健康委会主任
        { word: "全意为人们服务", level: 18 },// 全心全意为人们服务
        { word: "盗草", level: 18 },//盗草使文物离开了其依存的环境，会对文物造成损害
        { word: "纵览全局", level: 18 },//确保党始终纵览全局、协调各方
        { word: "突出突出", level: 18 },// M市旧城改造突出突出”修旧如旧“
        { word: "社会情民意", level: 18 },// 公民通过社会情民意反映制度参与民主决策。
        { word: "经济持续可发展", level: 18 },// 经济持续可发展受到日益关注。
        { word: "與", level: 18 },//需要坚持正确的與论导向，加
        { word: "概据", level: 18 },// 要根据题中所有材料概括公民与法律的关系
        { word: "区域治治", level: 18 },//我国的民族区域治治制度
        { word: "国家的一切权利", level: 18 },// 国家的一切权利是人民赋予的 有错别字，请修改。 权力
        { word: "灾亡", level: 18 },// 总是在一定条件下产生，又在一定条件下灾亡。
        { word: "当时不能", level: 18 },// 当时不能损害他人、社会的合法利益
        { word: "事实求是", level: 18 },//事实求是作答————事实→实事
        { word: "党的目标", level: 18 },// 立党为公、执政为民是党的目标 执政理念
        { word: "开展移风易俗、弘扬时代新风行动，改造落后文化，坚决抵制腐朽文化，故", level: 18 },// 雷 解析不全 开展移风易俗、弘扬时代新风行动，改造落后文化，坚决抵制腐朽文化，故
        { word: "自由与限制的关系", level: 18 },// 知识点为：自由与限制的关系。  自由与法治的关系。
        { word: "以以", level: 18 },// 题目以以某村村委会进行换届选举为素材
        { word: "优秀传的文化", level: 18 },// “中华优秀传的文化”改为“中华优秀传统文化”
        { word: "收受理", level: 18 },//        全国主要网站收受理的案件数量减少
        { word: "表决权时人大代表的职权", level: 18 },//表决权时人大代表的职权 时 改为 是
        { word: "宪法礼我们", level: 18 },// 宪法礼我们 离我们
        { word: "负责任法国", level: 18 },// 考生可从负责任法国等角度入手作答即可。————法国→大国。
        { word: "做法事", level: 18 },// 正确做法事积极参加社区环保公益活动，————事→是
        { word: "原则时民主", level: 18 },//我国人民代表大会的组织和活动原则时民主集中制，
        { word: "不是一昧放大", level: 18 },//
        { word: "发自内省", level: 18 },// 遵守社会规则需要我们发自内省地敬畏规则 内心
        { word: "是致的", level: 18 },// 国家利益与个人利益根本上是致的，————是后加：一。
        { word: "独立为行为", level: 18 },// 公民在法律范围内有独立为行为而不受他人干涉
        { word: "信仰自由的权力", level: 18 },// 宗教信仰自由的权力————权力→权利
        { word: "白己", level: 18 },//“白己”改成“自己”。
        { word: "遵守正规", level: 18 },// 遵守正规——————正规→规则，或交规
        { word: "法律处于保护", level: 18 },// 法律处于保护弱者利益的考虑，“出于”
        { word: "给与", level: 18 },// 给与的帮助 终审给予
        { word: "处于保护弱者", level: 18 },//法律处于保护弱者利益的考虑，
        { word: "保障各少数的合法", level: 18 },//雷  保障各少数的合法权利和利益。
        { word: "社会存在于社会意识", level: 18 },// 社会存在于社会意识的 社会存在与社会意识的辩证关系。
        { word: "实现共同理想是应该", level: 18 },//中学生在实现共同理想是应该怎么做。
        { word: "国际事物", level: 18 },//夸大中国在国际事物中的作用
        { word: "社会步", level: 18 },// 促进了的社会步”改成“促进了以民主法制为核心的社会进步”
        { word: "社会存在决定意识", level: 18 },// 社会存在决定意识， 社会意识
        { word: "禁止禁止", level: 18 },// 禁止禁止做的的”改成“禁止做的”。
        { word: "要早好", level: 18 },// 全体社会成员要早好自身防护，
        { word: "考查的是主要知识点为", level: 18 },//本题考查的是主要知识点为：————是，删除
        { word: "社和会", level: 18 },// 人类社和会的物质性
        { word: "电枧", level: 18 },// 从传统电枧进入智慧屏时代。
        { word: "拓财", level: 18 },// 拓宽财政
        { word: "扩大业", level: 18 },// 增加税收、扩大业、促进大众创业 就业
        { word: "对你改革开放", level: 18 },//本题是对你改革开放的考查
        { word: "审批机关", level: 18 },//审批机关与检察机关————审批→审判
        { word: "履职不利", level: 18 },// 对履职不利的领导进行问责——————不利→不力
        { word: "材料要习近", level: 18 },// 材料要习近平总书记的话为素材，以习近平总书记的话为素材
        { word: "传播正量", level: 18 },// 传播正量 正能量
        { word: "共和共", level: 18 },// 中华人民共和共主席不具有立法权，故D......共和共改成：共和国
        { word: "国家检察职能", level: 18 },//国家检察职能......监察。 检察是检察院
        { word: "在抗疫的作用", level: 18 },//
        { word: "心里老师", level: 18 },// 小李在心里老师的指导下
        { word: "国家全国人大常委会", level: 18 },// 可以国家全国人大常委会的决定 国家改成“根据
        { word: "是主观符合客观", level: 18 },// 要坚持与时俱进，是主观符合客观” 改成使
        { word: "肯定有否定", level: 18 },// 既肯定有否定”改为“既肯定又否定”。
        { word: "双面发展", level: 18 },// “双面发展”改为“全面发展”。
        { word: "材料中材料", level: 18 },//
        { word: "气着，", level: 18 },// 气着，理之依也 气着”改为“气者”
        { word: "本质工作", level: 18 },// 好好学习，做好本质工作，为服务社会打下坚实的基础。本质”改成“本职
        { word: "提索", level: 18 },// 各家平台尚未提索出一套行之有效的发展模式。 探索
        { word: "人大网上公文公布", level: 18 },// 中国人大网上公文公布相关法律并面向公 雷
        { word: "福社", level: 18 },// 福祉
        { word: "贫因", level: 18 },// 贫困
        { word: "台理", level: 18 },// 合理
        { word: "党领人民", level: 18 },//  领导
        { word: "多村", level: 18 },// 乡村
        { word: "医难群众", level: 18 },//对医难群众予以价格补贴，
        { word: "理台法", level: 18 },// 合法  false 出台法律
        { word: "人谋幸福", level: 18 },// 为人谋幸福
        { word: "充分符合", level: 18 },// 充分符合法律、道德对村民自治的规范和促进作用 符合改为发挥
        { word: "社会存在于社会意识", level: 18 },// 社会存在于社会意识的辩证关系“ 于改为与
        { word: "阶段阶段", level: 18 },//“阶段阶段”改成“初级阶段”。
        { word: "人民当家作主的权力", level: 18 },// 保证人民当家作主的权力……权力→权利  八年级
        { word: "此题考查的主要知识为：财政。", level: 18 },//     雷
        { word: "坚持分为二", level: 18 },// 坚持分为二 一分为二
        { word: "潜移墨默化", level: 18 },// 这体现了文化会潜移墨默化地影响人的思维方式 潜移墨默化 改为 潜移默化
        { word: "购房同", level: 18 },// 如果他不履行购房同 购房同 改为 购房合同
        { word: "反对反腐", level: 18 },//      有利于加强党反对反腐败工作的集中统一领导。
        { word: "共同富裕道理", level: 18 },// 我国走共同富裕道理 共同富裕道路
        { word: "致富致富", level: 18 },//当地政府对致富致富能手的表彰
        { word: "对权利的行使进行制约", level: 18 },// 必须对权利的行使进行制约”中的“权利”改为“权力”。
        { word: "和和", level: 18 },//
        { word: "读体干", level: 18 },//解读体干
        { word: "相互相成", level: 18 },// 相辅相成
        { word: "故D②④正确，ABD错误", level: 18 },//   雷
        { word: "本题主要考查的知识点。", level: 18 },// 雷
        { word: "检查权", level: 18 },//
        { word: "所有法律的综合", level: 18 },//宪法不是所有法律的综合 总和
        { word: "张文红", level: 18 },//
        { word: "违法相关法", level: 18 },//
        { word: "社会各部的", level: 18 },//有利于实现资源在社会各部的合理分配 各部 改为 各部门
        { word: "市场放税", level: 18 },//向市场放税 改为 向市场放权
        { word: "影响影响", level: 18 },//
        { word: "集体的事物", level: 18 },//      集体的事物……事物→事务。
        { word: "新域", level: 18 },// 新城
        { word: "依法治百国", level: 18 },//
        { word: "考考查", level: 18 },//  本题考考查的知识点是
        { word: "调解情绪", level: 18 }, // 
        // { word: "于切", level: 18 }, //  ？？有冲突 ：有利于切实
        { word: "广品", level: 18 },//       因此创新文化广品
        { word: "忧于", level: 18 },//我国农村经济发展忧于城镇经济发展
        { word: "法规定了国家最根本、最基础", level: 18 },// “宪法规定了国家最根本、最基础的问题”改成“宪法规定了国家生活中最根本、最重要的问题”
        { word: "集改", level: 18 },//  浅浅粉红          集改”改成“篡改”
        { word: "总览全局", level: 18 },// 总览全局、协调各方的作用，改为总揽全局、协调各方的作用，
        { word: "仟细", level: 18 },//  仔细
        { word: "学生学生", level: 18 },//  要依靠学生学生日常生活中对时政素材的关注和积累
        { word: "党统揽全局", level: 18 },//党统揽全局、协调各方改为了党总揽全局、协调各方
        { word: "社会和谐社会", level: 18 },//
        { word: "结合相关只是", level: 18 },//          雷  可以从努力学习与参加实践的角度并结合相关只是进行说明即可。
        { word: "荣誉被泄露", level: 18 },// 个人隐私及信息荣誉被泄露，  容易
        { word: "抗议防疫", level: 18 },// 抗疫防疫
        { word: "规定时限", level: 18 },// 并规定时限公民基本权利的保障措施——————时限→实现
        { word: "国时政部", level: 18 },// 中国时政部  中国财政部
        { word: "水远", level: 18 },// 祖国水远是你们的坚强后盾，
        { word: "家切权力", level: 18 },// 国家切权力属于人民。————切→一切
        { word: "本体要求从", level: 18 },// 本体要求从坚持党的领导的角度回答
        { word: "习近苹", level: 18 },//
        { word: "公民当家作", level: 18 },//  切实保障维护公民当家作主地位
        { word: "行驶自由和权利", level: 18 },// 行驶自由和权利
        { word: "能能", level: 18 },// 合作能能发挥每个人的最大价值
        { word: "未成年保护法", level: 18 },// 未成年保护法……“年”后加：人
        { word: "待如", level: 18 },// 对待如违法行为及时处罚
        { word: "人民是国家的主任", level: 18 },// 人民是国家的主任
        { word: "管理国家事务的权利", level: 18 },// 表明人民享有管理国家事务的权利 雷
        { word: "中国国梦", level: 18 },//
        { word: "疫重要物质", level: 18 },// 口罩属于防疫重要物质 物质改为物资
        { word: "人民宗教信仰", level: 18 },// 保障人民宗教信仰自由权利 人民改为公民
        { word: "特别征", level: 18 },//  强调法律具有强制性特别征
        { word: "单车行来", level: 18 },// 说明“退烧”对共享单车行来而言是件好事 行来 改为 行业
        { word: "国际交往中不平等现在", level: 18 },// 当今世界，在国际交往中不平等现在仍然存在，
        { word: "在在", level: 18 },//
        { word: "不可沉迷于网络无直接关系 ，", level: 18 },// 不可沉迷于网络无直接关系 ， 雷 C正确 答案D 自相矛盾
        { word: "物质供", level: 18 },//物质供给保障工作
        { word: "法规法", level: 18 },// 法律法规法角度 法律法规的角度
        { word: "桃战", level: 18 },// 敢于向权威桃战。
        { word: "披巧", level: 18 },//  批判的披巧:抛判只针对事情本身
        { word: "抛判", level: 18 },//
        { word: "再度进人", level: 18 },// 雷 世界再度进人“博鳌时间”，体现我国国际地位的提高，故③项正确；
        { word: "善良有爱", level: 18 },// 善良有爱，————有爱→友爱
        { word: "广能", level: 18 },// 促进国际广能合作,改为促进国际产能合作，
        { word: "是今时代", level: 18 },// 和平与发展是今时代的主题。
        { word: "互签", level: 18 },// 互签”改成“互鉴”。
        { word: "不同人们", level: 18 },// 不同人们建议把“不同人们”改成“不同人”。
        { word: "战役英", level: 18 },//战役英雄  疫情
        // { word: "个民族", level: 18 },   // 干扰  一个民族
        { word: "国家社会", level: 18 },     //pink 粉红
        { word: "家业指", level: 18 },// 为党和国家业指引正确的前进方向。
        { word: "校规校级", level: 18 },// MistyRose 浅浅红 遵守校规校级————级→→纪
        { word: "带案来", level: 18 },// 一盎司创意能够带案来无以数计的商业利益
        { word: "项违背", level: 18 },// 不得与宪法的原则和精神项违背，
        { word: "以宪治", level: 18 },// 就是坚持以宪治国的要求，而不是坚持以宪执政的原因
        { word: "以宪执", level: 18 },//  MistyRose 浅浅红
        { word: "和反应", level: 18 },// 法律是统治阶级意志的体现和反应……反应→反映
        { word: "很不能", level: 18 },// 当前我国生产力发展水平很不能————很→还
        { word: "行使权力有界限", level: 18 },// 做到行使权力有界限……权力→权利
        { word: "地地", level: 18 },// 脚踏实地地付出努力“地”改成“的
        { word: "集中人民办大事", level: 18 },// 人民”改成“力量
        { word: "知识要素", level: 18 },// 知识要素改成知识要点
        { word: "设要求", level: 18 },// 设要求改为设问要求
        { word: "是可以是", level: 18 },// A.敬畏感是可以是对伟大人物的崇敬感
        { word: "漫画反映了漫画", level: 18 },// 漫画反映了漫画反映了我国
        { word: "本题的对", level: 18 },// 本题的对 本题是对教材基础知识的考查
        { word: "一切权利属于人民", level: 18 },// 中华人民共和国的一切权利属于人民 权利 改为 权力
        { word: "价值观体系建设", level: 18 },// 社会主义核心价值体系建设
        { word: "问前", level: 18 },// 问前改为奔腾向前 MistyRose 浅浅红
        { word: "主取决于", level: 18 },// 主取决于 改为 主要取决于
        { word: "付责", level: 18 },// 应付相应责任
        { word: "角度析", level: 18 },// 从公民的角度析 改成分析
        { word: "建议项", level: 18 },// 公民支持重点建议项目 建设
        { word: "创作性", level: 18 },// 激发创作性……作→造。
        { word: "支律", level: 18 },// 民族精神的支律和鼓舞作用是密不可分的 支律 改为 支撑
        { word: "兼顺", level: 18 },// 兼顺效率与公平 兼顺 改为 兼顾
        { word: "加以规律", level: 18 },// 公民的基本权利是由法律加以规律的，——————规律→规定
        { word: "指定定", level: 18 },// 尽快到指定定医院就医
        { word: "全年从严", level: 18 },// 十八届六中全会强调全年从严治党
        { word: "列题", level: 18 },// 类题目
        { word: "活动动", level: 18 },// 加强公共文化设施建设，开展公共文化服务活动动，
        { word: "该发第", level: 18 },// 人权原则的直接体现是该发第五条 发→法
        { word: "展法执法检", level: 18 },// 开展法执法检查 改为 开展执法检查
        { word: "地方各级全国人", level: 18 },// 还可以通过地方各级全国人民代表大会行使国家权力，
        { word: "望造", level: 18 },// 文化望造人生 塑造
        { word: "安情", level: 18 },//  疫情
        { word: "全国盘棋", level: 18 },// 一盘棋
        { word: "知识的入手", level: 18 },     //知识的入手进行作答
        { word: "自恨", level: 18 },// “自恨”改成“自身”  MistyRose 浅浅红
        { word: "材料为表明", level: 18 },// 材料未表明
        { word: "从坚强", level: 18 },// 从坚强宪法监督 加强
        { word: "国家对的", level: 18 },// 但处处维护国家对的利益……对→队。
        { word: "建立的完善", level: 18 },// 中国逐渐建立的完善了 和
        { word: "在进行分析", level: 18 },// 再
        { word: "于他人", level: 18 },//  与
        { word: "文化文化", level: 18 },//
        { word: "可以我们", level: 18 },//  让我们
        { word: "遵守法定义务", level: 18 },// 没有遵守法定义务
        { word: "治国的伟大事迹", level: 18 },// 依法治国的伟大事迹  伟大实践MistyRose 浅浅红
        { word: "的些", level: 18 },// 我国在保障民生方面的些重要举措
        { word: "材料使如何", level: 18 },// 材料使如何发挥意识能动作用的
        { word: "说法中太", level: 18 },//  该选项说法中太绝对，
        // { word: "依法行使权利", level: 18 },// 依法行使权利……权利→权力
        { word: "有利于有利", level: 18 },// 这一举措有利于有利于政府科学决策
        { word: "解答是", level: 18 },//  解答时   MistyRose 浅浅红
        { word: "创断", level: 18 },//  创新
        { word: "法律效率", level: 18 },// 效力
        { word: "对对", level: 18 },//
        { word: "表明表明", level: 18 },//
        { word: "专专", level: 18 },//
        { word: "纪纪", level: 18 },//  世纪  MistyRose 浅浅红
        { word: "还还", level: 18 },//  还很
        { word: "以靠", level: 18 },// 依靠
        { word: "分析概况", level: 18 },// 概括
        { word: "降低最低", level: 18 },// 降到
        { word: "教有", level: 18 },     // 教育
        { word: "范性文化", level: 18 },// 行政规范性文件
        { word: "使如何", level: 18 },// 是
        { word: "说法中太", level: 18 },// 说法中太绝对
        { word: "决绝", level: 18 },// 拒绝
        { word: "分析分析", level: 18 },//
        { word: "坚持像群众", level: 18 },// 向
        { word: "实现按劳", level: 18 },// 我国实现按劳分配为主体 实现改为实行
        { word: "由国家制度", level: 18 },// 制定 MistyRose 浅浅红
        { word: "终南山", level: 18 },     // 钟南山”
        { word: "社会社会", level: 18 },//
        { word: "知只", level: 18 },// 知识
        { word: "由法律依据", level: 18 },// 有
        { word: "同时有", level: 18 },// 同时有害怕自己的能力不够 又
        { word: "体系体系", level: 18 },// 不体现竞争有序的现代市场体系体系
        { word: "小微企业按照规定实行缓征、减征", level: 18 },// 雷 对符合条件的小微企业按照规定实行缓征、减征、免征企业所得税、增值税等 可能是：表述不全，加上措施。
        { word: "目觉", level: 18 },// 目觉履行公民义务”
        { word: "法制社会", level: 18 },// 法治社会一体建设
        { word: "于什么", level: 18 },
        




        { word: "尊重考核", level: 27 }, //27] = brown; 可
        { word: "放放", level: 27 },
        { word: "参于", level: 27 }, // 可能错误
        { word: "守践", level: 27 },
        { word: "上开性", level: 27 },
        { word: "集合自身", level: 27 },
        { word: "面相", level: 27 },
        // { word: "本体", level: 27 },// c根本体现
        { word: "老奶奶", level: 27 },
        { word: "实施民主", level: 27 },
        { word: "民主关系", level: 27 },
        { word: "报本", level: 27 },
        { word: "看郭某鹏待", level: 27 },
        { word: "克已奉公", level: 27 },
        

        { word: "考察", level: 27 }, // brown;
        { word: "考查", level: 13 },  // Ivory;

        // { word: "全是", level: 21 },  //Lavender
        { word: "选择者", level: 21 },
        { word: "的解，", level: 21 },  //Lavender
        // { word: "政机", level: 21 },  //    ？？
        { word: "下工夫", level: 21 },  //Lavender  淡暗灰色 一丝丝蓝
        // { word: "要强", level: 21 },  //  ？？
        { word: "现代建设", level: 21 },   //现代化
        







        { word: "这样做法", level: 18 },  //MistyRose
        { word: "躲过", level: 18 },
        { word: "简介参", level: 18 },
        // { word: "由", level: 18 }, // 干扰
        { word: "统帅", level: 18 },// 统帅：只可作名词，表示主帅、将军。统率：只可作动词，表示指挥、带领。
        { word: "改怎", level: 18 },//MistyRose 浅浅红
        { word: "这是这是", level: 18 },
        { word: "体现改革", level: 18 },
        { word: "负责入", level: 18 },
        { word: "经济话", level: 18 }, //经济活 雷
        { word: "话经济", level: 18 },//MistyRose 浅浅红
        { word: "相应国家号召", level: 18 },  // 响应国家号召
        // { word: "学习自我调节", level: 18 }, //学会、 进一步激发   ？ 没有截图佐证  跟正确文字混淆影响正常审题
        { word: "进步激发", level: 18 },
        { word: "题干意识", level: 18 },//  意思
        { word: "围内是", level: 18 },//  设问范围内是
        { word: "的而", level: 18 },//  凝结的而铸就的
        { word: "此时中", level: 18 }, // 从此时中
        { word: "个人安慰", level: 18 }, //安危
        { word: "一撮而就", level: 18 }, // 一蹴而就
        { word: "大才会好", level: 18 },
        { word: "关系和爱护", level: 18 },//关心和爱护 浅浅红
        { word: "中国民族", level: 18 },
        { word: "以宪治", level: 18 },// 依宪治国
        { word: "完治", level: 18 },// 依宪治国
        { word: "取情", level: 18 }, //才能夺取疫情防控
        { word: "用用", level: 18 },//  做事总用用不完的劲  MistyRose 浅浅红
        { word: "食物之间联系", level: 18 },// 事物
        { word: "素尚", level: 18 }, //  崇尚
        { word: "程程", level: 18 },   // “程程度”改成“程度”
        { word: "兴题", level: 18 },//  兴趣。
        { word: "分主要", level: 18 },//主要分
        { word: "引导宗教与社会主义相适应", level: 18 },//引导宗教与社会主义社会相适应
        { word: "团结的党", level: 18 },// 把广大信教群众团结的党和政府周围
        { word: "由法律依据", level: 18 }, //由法律依据……由→有
        { word: "全国入大", level: 18 },//MistyRose 浅浅红
        { word: "宗教和顺", level: 18 },//  雷
        { word: "不属于社会主义本质要求的内容，故C", level: 18 },// 雷 不属于社会主义本质要求的内容，故C 雷
        { word: "中国特色社会主义度是根", level: 18 },   //  雷，
        { word: "协商构成", level: 18 },// 政协委员是我国专门政治协商构成员，
        { word: "下去派出所", level: 18 }, //辖区
        { word: "经济基层", level: 18 },//MistyRose 浅浅红
        


        //    {        word:"与",        level:12    },  //lightgray
        //    {        word:"于",        level:10    },  //skyblue
        { word: "国家社会", level: 15 },  // 国际社会  lightcyan
        // { word: "应有", level: 15 },// 应有浩宇负责
        { word: "对对", level: 15 },  //   lightcyan
        // { word: "既", level:  },  //lightgreen 略微有点亮
        { word: "耍", level:19 },  //Khaki
        { word: "既", level: 17 },  //purplegray
        { word: "即", level: 15 },  //lightcyan
        { word: "已", level: 17 },  //purplegray
        // { word: "己", level: 15 },  //lightcyan
        { word: "权利", level: 13 },  // Ivory;
        { word: "权力", level: 16 },  //Aqua
        {        word:"检查",     level: 19 },  //Khaki 可

        // {        word:"检查",     level: 19 },  //Khaki
        {        word:"髙",     level: 19 },  //Khaki
        {        word:"!",     level: 19 },  //Khaki
        // {        word:"检查",     level: 19 },  //Khaki
        // {        word:"检察",     level: 18 },  //MistyRose

        { word: "-", level: 18 }, //pink 粉红色
        { word: "—", level: 19 }, //淡色
        { word: "的的", level: 19 },


        { word: "入",level: 19 },  //Khaki
        { word: "人", level: 14 },  //azure





        { word: "那", level: 17 },  //purplegray
        // { word: "指定", level: 17 },  //



        { word: "正确", level: 26 }, //rightgreen
        { word: "项符合题意", level: 26 }, //rightgreen
        { word: "错误", level: 29 }, //lightorange




    ]

    var color_selection = [];
    color_selection[17] = purplegray;    color_selection[22] = lightgray;
    color_selection[23] = lightgreen;    color_selection[26] = rightgreen;
    color_selection[57] = tomatored;     color_selection[27] = brown;
    color_selection[41] = orange;        color_selection[29] = lightorange;
    color_selection[48] = pink;          color_selection[30] = skyblue;
    color_selection[14] = azure;         color_selection[15] = lightcyan;
    color_selection[18] = MistyRose;     color_selection[19] = Khaki;
    color_selection[36] = GreenYellow;   color_selection[21] = Lavender;
    color_selection[16] = Aqua;          color_selection[13] = Ivory;

}

////////////////////////////////////////////////////////////////////////////////////
